#### AnalyticalEquipmentLoadData Members

---

|  |
| --- |
| AnalyticalEquipmentLoadData Class   Methods   Properties   See Also |

The  AnalyticalEquipmentLoadData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  AnalyticalDistributionNodePropertyData  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ApparentLoad | The electrical apparent load of analytical equipment load. |
| Public property | Current | The current of the analytical equipment load. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  AnalyticalDistributionNodePropertyData  .) |
| Public property | LoadClassification | The load classification of analytical equipment load. |
| Public property | LoadType | The load type of analytical equipment load. |
| Public property | NumberOfPhases | The number of phases. (Inherited from  AnalyticalDistributionNodePropertyData  .) |
| Public property | PowerFactor | The power factor of analytical equipment load. |
| Public property | TrueLoad | The electrical true load of analytical equipment load. |
| Public property | Voltage | The voltage of the analytical equipment load. |

# See Also

AnalyticalEquipmentLoadData Class

Autodesk.Revit.DB.Electrical Namespace